; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	infrared0 - mode
	image2 - mode
	spectrograph1 - mode
	Star1 - direction
	Star0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Planet4 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star0)
	(supports instrument1 image2)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet4)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 124)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star0)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 101)
	(supports instrument5 spectrograph1)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 148)
	(= (data Planet4 infrared0) 195)
	(= (data Planet5 infrared0) 39)
	(= (data Planet6 infrared0) 173)
	(= (data Star7 infrared0) 32)
	(= (data Star8 infrared0) 267)
	(= (data Planet4 image2) 3)
	(= (data Planet5 image2) 285)
	(= (data Planet6 image2) 115)
	(= (data Star7 image2) 142)
	(= (data Star8 image2) 18)
	(= (data Planet4 spectrograph1) 107)
	(= (data Planet5 spectrograph1) 162)
	(= (data Planet6 spectrograph1) 85)
	(= (data Star7 spectrograph1) 290)
	(= (data Star8 spectrograph1) 264)
	(= (slew_time Star1 Star0) 57.37)
	(= (slew_time Star0 Star1) 57.37)
	(= (slew_time GroundStation2 Star0) 18.87)
	(= (slew_time Star0 GroundStation2) 18.87)
	(= (slew_time GroundStation2 Star1) 46.43)
	(= (slew_time Star1 GroundStation2) 46.43)
	(= (slew_time GroundStation3 Star0) 57.03)
	(= (slew_time Star0 GroundStation3) 57.03)
	(= (slew_time GroundStation3 Star1) 61.39)
	(= (slew_time Star1 GroundStation3) 61.39)
	(= (slew_time GroundStation3 GroundStation2) 4.754)
	(= (slew_time GroundStation2 GroundStation3) 4.754)
	(= (slew_time Planet4 Star0) 59)
	(= (slew_time Star0 Planet4) 59)
	(= (slew_time Planet4 Star1) 30.16)
	(= (slew_time Star1 Planet4) 30.16)
	(= (slew_time Planet4 GroundStation2) 34.01)
	(= (slew_time GroundStation2 Planet4) 34.01)
	(= (slew_time Planet4 GroundStation3) 20.26)
	(= (slew_time GroundStation3 Planet4) 20.26)
	(= (slew_time Planet5 Star0) 22.47)
	(= (slew_time Star0 Planet5) 22.47)
	(= (slew_time Planet5 Star1) 0.6934)
	(= (slew_time Star1 Planet5) 0.6934)
	(= (slew_time Planet5 GroundStation2) 26.99)
	(= (slew_time GroundStation2 Planet5) 26.99)
	(= (slew_time Planet5 GroundStation3) 9.597)
	(= (slew_time GroundStation3 Planet5) 9.597)
	(= (slew_time Planet5 Planet4) 21.44)
	(= (slew_time Planet4 Planet5) 21.44)
	(= (slew_time Planet6 Star0) 78.82)
	(= (slew_time Star0 Planet6) 78.82)
	(= (slew_time Planet6 Star1) 50.07)
	(= (slew_time Star1 Planet6) 50.07)
	(= (slew_time Planet6 GroundStation2) 18.49)
	(= (slew_time GroundStation2 Planet6) 18.49)
	(= (slew_time Planet6 GroundStation3) 93.12)
	(= (slew_time GroundStation3 Planet6) 93.12)
	(= (slew_time Planet6 Planet4) 20.1)
	(= (slew_time Planet4 Planet6) 20.1)
	(= (slew_time Planet6 Planet5) 2.843)
	(= (slew_time Planet5 Planet6) 2.843)
	(= (slew_time Star7 Star0) 62.31)
	(= (slew_time Star0 Star7) 62.31)
	(= (slew_time Star7 Star1) 28.93)
	(= (slew_time Star1 Star7) 28.93)
	(= (slew_time Star7 GroundStation2) 33.62)
	(= (slew_time GroundStation2 Star7) 33.62)
	(= (slew_time Star7 GroundStation3) 56.22)
	(= (slew_time GroundStation3 Star7) 56.22)
	(= (slew_time Star7 Planet4) 37.22)
	(= (slew_time Planet4 Star7) 37.22)
	(= (slew_time Star7 Planet5) 27.17)
	(= (slew_time Planet5 Star7) 27.17)
	(= (slew_time Star7 Planet6) 5.877)
	(= (slew_time Planet6 Star7) 5.877)
	(= (slew_time Star8 Star0) 26.2)
	(= (slew_time Star0 Star8) 26.2)
	(= (slew_time Star8 Star1) 22.51)
	(= (slew_time Star1 Star8) 22.51)
	(= (slew_time Star8 GroundStation2) 81.06)
	(= (slew_time GroundStation2 Star8) 81.06)
	(= (slew_time Star8 GroundStation3) 11.8)
	(= (slew_time GroundStation3 Star8) 11.8)
	(= (slew_time Star8 Planet4) 39.65)
	(= (slew_time Planet4 Star8) 39.65)
	(= (slew_time Star8 Planet5) 48.09)
	(= (slew_time Planet5 Star8) 48.09)
	(= (slew_time Star8 Planet6) 52.48)
	(= (slew_time Planet6 Star8) 52.48)
	(= (slew_time Star8 Star7) 5.784)
	(= (slew_time Star7 Star8) 5.784)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite2 Planet5)
	(have_image Planet4 spectrograph1)
	(have_image Planet5 spectrograph1)
	(have_image Planet6 spectrograph1)
	(have_image Star7 image2)
	(have_image Star8 infrared0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star1 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 124 to 93.84, (fuel-used) from 0 to 30.16
   goals met: 0 of 6
2. (turn_to satellite2 planet6 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 148 to 142.123, (fuel-used) from 30.16 to 36.037
   goals met: 0 of 6
3. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 6
4. (calibrate satellite0 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 6
5. (turn_to satellite0 star8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 93.84 to 71.33, (fuel-used) from 36.037 to 58.547
   goals met: 0 of 6
6. (take_image satellite0 star8 instrument2 infrared0)
   added: (have_image star8 infrared0)
   changed: (data_capacity satellite0) from 1000 to 733, (data-stored) from 0 to 267
   goals met: 1 of 6
7. (turn_to satellite0 star7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 71.33 to 65.546, (fuel-used) from 58.547 to 64.331
   goals met: 1 of 6
8. (turn_to satellite0 planet5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 65.546 to 38.376, (fuel-used) from 64.331 to 91.501
   goals met: 1 of 6
9. (take_image satellite0 planet5 instrument2 spectrograph1)
   added: (have_image planet5 spectrograph1)
   changed: (data_capacity satellite0) from 733 to 571, (data-stored) from 267 to 429
   goals met: 2 of 6
10. (turn_to satellite0 planet6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 38.376 to 35.533, (fuel-used) from 91.501 to 94.344
   goals met: 2 of 6
11. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 142.123 to 139.28, (fuel-used) from 94.344 to 97.187
   goals met: 3 of 6
12. (turn_to satellite0 planet4 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 35.533 to 15.433, (fuel-used) from 97.187 to 117.287
   goals met: 3 of 6
13. (take_image satellite0 planet4 instrument2 spectrograph1)
   added: (have_image planet4 spectrograph1)
   changed: (data_capacity satellite0) from 571 to 464, (data-stored) from 429 to 536
   goals met: 4 of 6
14. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 4 of 6
15. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 139.28 to 136.437, (fuel-used) from 117.287 to 120.13
   goals met: 3 of 6
16. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 136.437 to 133.594, (fuel-used) from 120.13 to 122.973
   goals met: 4 of 6
17. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 133.594 to 130.751, (fuel-used) from 122.973 to 125.816
   goals met: 3 of 6
18. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 130.751 to 127.908, (fuel-used) from 125.816 to 128.659
   goals met: 4 of 6
19. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 127.908 to 125.065, (fuel-used) from 128.659 to 131.502
   goals met: 3 of 6
20. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 125.065 to 122.222, (fuel-used) from 131.502 to 134.345
   goals met: 4 of 6
21. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 122.222 to 119.379, (fuel-used) from 134.345 to 137.188
   goals met: 3 of 6
22. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 119.379 to 116.536, (fuel-used) from 137.188 to 140.031
   goals met: 4 of 6
23. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 116.536 to 113.693, (fuel-used) from 140.031 to 142.874
   goals met: 3 of 6
24. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 113.693 to 110.85, (fuel-used) from 142.874 to 145.717
   goals met: 4 of 6
25. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 110.85 to 108.007, (fuel-used) from 145.717 to 148.56
   goals met: 3 of 6
26. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 108.007 to 105.164, (fuel-used) from 148.56 to 151.403
   goals met: 4 of 6
27. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 105.164 to 102.321, (fuel-used) from 151.403 to 154.246
   goals met: 3 of 6
28. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 102.321 to 99.478, (fuel-used) from 154.246 to 157.089
   goals met: 4 of 6
29. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 99.478 to 96.635, (fuel-used) from 157.089 to 159.932
   goals met: 3 of 6
30. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 96.635 to 93.792, (fuel-used) from 159.932 to 162.775
   goals met: 4 of 6
31. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 93.792 to 90.949, (fuel-used) from 162.775 to 165.618
   goals met: 3 of 6
32. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 90.949 to 88.106, (fuel-used) from 165.618 to 168.461
   goals met: 4 of 6
33. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 88.106 to 85.263, (fuel-used) from 168.461 to 171.304
   goals met: 3 of 6
34. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 85.263 to 82.42, (fuel-used) from 171.304 to 174.147
   goals met: 4 of 6
35. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 82.42 to 79.577, (fuel-used) from 174.147 to 176.99
   goals met: 3 of 6
36. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 79.577 to 76.734, (fuel-used) from 176.99 to 179.833
   goals met: 4 of 6
37. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 76.734 to 73.891, (fuel-used) from 179.833 to 182.676
   goals met: 3 of 6
38. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 73.891 to 71.048, (fuel-used) from 182.676 to 185.519
   goals met: 4 of 6
39. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 71.048 to 68.205, (fuel-used) from 185.519 to 188.362
   goals met: 3 of 6
40. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 68.205 to 65.362, (fuel-used) from 188.362 to 191.205
   goals met: 4 of 6
41. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 65.362 to 62.519, (fuel-used) from 191.205 to 194.048
   goals met: 3 of 6
42. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 62.519 to 59.676, (fuel-used) from 194.048 to 196.891
   goals met: 4 of 6
43. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 59.676 to 56.833, (fuel-used) from 196.891 to 199.734
   goals met: 3 of 6
44. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 56.833 to 53.99, (fuel-used) from 199.734 to 202.577
   goals met: 4 of 6
45. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 53.99 to 51.147, (fuel-used) from 202.577 to 205.42
   goals met: 3 of 6
46. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 51.147 to 48.304, (fuel-used) from 205.42 to 208.263
   goals met: 4 of 6
47. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 48.304 to 45.461, (fuel-used) from 208.263 to 211.106
   goals met: 3 of 6
48. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 45.461 to 42.618, (fuel-used) from 211.106 to 213.949
   goals met: 4 of 6
49. (turn_to satellite2 groundstation3 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 groundstation3)
   changed: (fuel satellite2) from 42.618 to 33.021, (fuel-used) from 213.949 to 223.546
   goals met: 3 of 6
50. (calibrate satellite2 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 3 of 6
51. (turn_to satellite2 planet5 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 33.021 to 23.424, (fuel-used) from 223.546 to 233.143
   goals met: 4 of 6
52. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 23.424 to 20.581, (fuel-used) from 233.143 to 235.986
   goals met: 3 of 6
53. (turn_to satellite2 star7 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star7)
   changed: (fuel satellite2) from 20.581 to 14.704, (fuel-used) from 235.986 to 241.863
   goals met: 3 of 6
54. (take_image satellite2 star7 instrument5 image2)
   added: (have_image star7 image2)
   changed: (data_capacity satellite2) from 1000 to 858, (data-stored) from 536 to 678
   goals met: 4 of 6
55. (turn_to satellite2 planet6 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 14.704 to 8.827, (fuel-used) from 241.863 to 247.74
   goals met: 4 of 6
56. (take_image satellite2 planet6 instrument5 spectrograph1)
   added: (have_image planet6 spectrograph1)
   changed: (data_capacity satellite2) from 858 to 773, (data-stored) from 678 to 763
   goals met: 5 of 6
57. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 8.827 to 5.984, (fuel-used) from 247.74 to 250.583
   goals met: 6 of 6
